// 3. Напишите программу вычисления функции: y = x^3
Console.WriteLine("Please type number x >> ");
double x = Convert.ToDouble(Console.ReadLine());
double y = x * x * x;
Console.WriteLine ($"{y} is cube function of x ");
